Repository: OvrBtn/StudentUsos
Catalog: StudentUsos/Resources/LocalizedStrings/LocalizedStrings.*.resx
Languages: pl

# AboutAppPage_AboutApp
source: Studencki USOS is an unofficial application developed by a student at Poznań University of Technology majoring in Computer Science as part of the .NET Scientific Circle of Poznań University of Technology.
pl: Studencki USOS jest nieoficjalną aplikacją realizowaną przez studenta Politechniki Poznańskiej na kierunku Informatyka w ramach Koła Naukowego .NET Politechniki Poznańskiej

# AboutAppPage_Developer
source: Person responsible for applications - Olivier Betman, Poznań University of Technology.
pl: Osoba odpowiedzialna za aplikacje - Olivier Betman, Politechnika Poznańska.

# AboutAppPage_DeveloperContact
source: Contact for matters related to the application (questions, suggestions, errors, etc.):
pl: Kontakt w sprawach związanych z aplikacją (pytania, sugestie, błędy itp.):

# AboutAppPage_DeveloperTitle
source: Developer
pl: Deweloper

# AboutAppPage_PersonalData
source: Personal data
pl: Dane osobowe

# AboutAppPage_PersonalDataText1
source: The application does not send data outside the user's device. The only form of data collection is logs, which are used for diagnostic purposes, but they are not automatically sent. Logs can only be sent by the user from the application settings (previous page).
pl: Aplikacja nie wysyła danych poza urządzenie użytkownika. Jedyną formą zbierania danych są logi, które służą do celów diagnostycznych, lecz nie są one automatycznie wysyłane. Logi mogą zostać przesłane jedynie przez samego użytkownika z poziomu ustawień aplikacji (poprzednia strona).

# AboutAppPage_PersonalDataText2
source: Logs are automatically deleted from the device after 2 days.
pl: Logi są automatycznie usuwane z urządzenia po 2 dniach.

source: Account
pl: Konto

# ActivitiesPage_DownloadActivities
source: Download activities
pl: Pobierz zajęcia

# ActivitiesPage_Downloading
source: Downloading
pl: Pobieranie

# ActivitiesPage_EvenWeek
source: Even week
pl: Tydzień parzysty

# ActivitiesPage_OddWeek
source: Odd week
pl: Tydzień nieparzysty

# ActivitiesPage_Room
source: Room
pl: Sala

# ActivitiesPage_Today
source: Today
pl: Dzisiaj

source: Add
pl: Dodaj

source: Analyse
pl: Analizuj

# AppName
source: Student USOS
pl: Studencki USOS

# AppName_FirstPart
source: Student
pl: Studencki

source: Average
pl: Średnia

source: Calendar
pl: Kalendarz

# CalendarEventType_Break
source: break
pl: przerwa

# CalendarEventType_Dean
source: dean's
pl: dziekańskie

# CalendarEventType_ExamSession
source: exam session
pl: sesja egzaminacyjna

# CalendarEventType_Holidays
source: holiday
pl: święto

# CalendarEventType_PublicHolidays
source: holiday
pl: święto

# CalendarEventType_Rector
source: rector's
pl: rektorskie

# CalendarPage_DaysOfWeekLabels
source: M|T|W|T|F|S|S
pl: P|W|Ś|C|P|S|N

# CalendarPage_GoogleCalendar
source: Google Calendar
pl: Kalendarz Google

# CalendarSettingsPage_AddedCalendars
source: Added calendars
pl: Dodane kalendarze

# CalendarSettingsPage_HelpDescription
source: Some calendars allow you to export calendar in form of URL to iCalendar file (.ics). Using the button beside and the link you can connect e.g. Google Calendar to this app
pl: Niektóre kalendarze udostępniają możliwość wyeksportowania kalendarza w formie URL do pliku iCalendar (.ics). Korzystająć z przycisku obok oraz tego linku można podłączyć np. Kalendarz Google do tej aplikacji.

# CalendarSettingsPage_HelpTItle
source: Help
pl: Pomoc

# CalendarSettingsPage_NewCalendarDescription
source: Insert URL to iCalendar file (.ics) of calendar which you want to import
pl: Wpisz link do pliku iCalendar (.ics) kalendarza, który chcesz zaimportować

# CalendarSettingsPage_NewCalendarTitle
source: New calendar
pl: Nowy kalendarz

source: Cancel
pl: Anuluj

source: Comment
pl: Komentarz

source: Confirm
pl: Zatwierdź

source: Continue
pl: Kontynuuj

# Dashboard_Hello
source: Hi
pl: Hej

# Dashboard_NextEvents
source: Upcoming events
pl: Najbliższe wydarzenia

source: Day off!
pl: Dzień wolny!

source: Default
pl: Domyślny

# Errors_Error
source: Error
pl: Błąd

# Errors_LoadingError
source: Error
pl: Błąd

# Errors_USOSAPIConnectionError
source: Connection to USOS API error
pl: Błąd połączenia z USOS API

source: Final grades
pl: Zaliczenia

# GradesPage_CountIntoAverage
source: Counts into average
pl: Liczy się do średniej

# GradesPage_EditGrades
source: Edit grades
pl: Edytuj oceny

# GradesPage_Empty
source: No final grades to show
pl: Brak zaliczeń do wyświetlenia

# GradesPage_FirstTerm
source: I term
pl: I termin

# GradesPage_ScholarshipCalculator
source: Scholarship calculator
pl: Kalkulator stypendialny

# GradesPage_SecondTerm
source: II term
pl: II termin

source: Group
pl: Grupa

source: Groups
pl: Grupy

# LackOf
source: none
pl: brak

source: Language
pl: Język

source: Later
pl: Później

source: Lecturers
pl: Wykładowcy

source: Logging out
pl: Wylogowanie

# LoggingOut_Confirmation
source: Are you sure you want to log out?
pl: Czy na pewno chcesz się wylogować?

# LoggingPermissionDescription_Activities
source: Activities
pl: Plan zajęć

# LoggingPermissionDescription_Calendar
source: Calendar
pl: Kalendarz

# LoggingPermissionDescription_FinalGrades
source: Final grades
pl: Zaliczenia

# LoggingPermissionDescription_Groups
source: Groups
pl: Grupy

# LoggingPermissionDescription_Payments
source: Payments
pl: Płatności

# LoggingPermissionDescription_Progs
source: Major
pl: Kierunek studiów

# LoggingPermissionDescription_Surveys
source: Surveys
pl: Ankiety

# LoggingPermissionDescription_User
source: User (first name, last name, index numer)
pl: Użytkownik (imię, nazwisko, numer albumu)

# LoggingPermissionPopup_Title
source: I allow collecting information from following modules for diagnostic purposes (logs)
pl: Zezwalam na zbieranie w logach informacji w celach diagnostyczny z następujących modułów

# LoginPage_InputPIN
source: Input PIN code:
pl: Podaj PIN:

# LoginPage_IssueWithLogin
source: Issue with signing in?
pl: Problem z logowaniem?

# LoginPage_Login
source: Log in
pl: Zaloguj

# LoginPage_LoginFailed
source: Logging in failed
pl: Logowanie nie powiodło się

# LoginPage_LoginWithPIN
source: Log in using PIN code
pl: Zaloguj za pomocą kodu PIN

# Login_MissingScopes
source: Missing permissions:
pl: Brakujące pozwolenia:

source: Log out
pl: Wyloguj

# LogsPage_RemoveAll
source: Remove all
pl: Usuń wszystkie

source: Modification
pl: Modyfikacja

# MorePage_AppName
source: Student's USOS: Poznań University of Technology
pl: Studencki USOS: Politechnika Poznańska

# MorePage_DaysBefore
source: days in advance
pl: dni wcześniej

# MorePage_NotifyAt
source: at
pl: o godzinie

# MorePage_RevokeAccess
source: Revoke access to USOS
pl: Odbierz aplikacji dostęp do USOSa

# MultipleChoicePopup_Empty
source: No options
pl: Brak opcji

source: No
pl: Nie

source: Notifications
pl: Powiadomienia

# NotificationsDiagnosis_GoToSettings
source: Go to settings
pl: Przejdź do ustawień

# NotificationsDiagnosis_AutoStartTitle
source: Checking if device manufacturer defined additional permission which might block this application from receiving notifications after device reboot
pl: Sprawdzanie, czy producent urządzenia zdefiniował dodatkowe uprawnienie, które może blokować tę aplikację przed otrzymywaniem powiadomień po ponownym uruchomieniu urządzenia

# NotificationsDiagnosis_AutoStartWarningMessage
source: Manufacturer of your device might have defined a permission which could block this application from starting after rebooting the device. By clicking button below the app will try to forward you to the right settings page.
pl: Producent Twojego urządzenia mógł zdefiniować uprawnienie, które może blokować uruchamianie tej aplikacji po ponownym uruchomieniu urządzenia. Klikając przycisk poniżej, aplikacja spróbuje przekierować Cię do odpowiedniej strony ustawień

# NotificationsDiagnosis_BackgroundRestrictedButton
source: Allow running in background
pl: Zezwól na działanie w tle

# NotificationsDiagnosis_BackgroundRestrictedErrorDescription
source: This application is not allowed to run in background, this could potentially block some notifications.
pl: Działanie aplikacji w tle jest zablokowane, co może potencjalnie prowadzić do nie otrzymywania niektórych powiadomień.

# NotificationsDiagnosis_BackgroundRestrictedTitle
source: Checking if application is restricted from running in the background
pl: Sprawdzanie czy działanie aplikacji w tle jest ograniczone

# NotificationsDiagnosis_BatteryOptimizationErrorDescription
source: Your device has battery optimization enabled for this app, this might break notifications
pl: Na Twoim urządzeniu włączona jest optymalizacja baterii dla tej aplikacji, co może powodować problemy z powiadomieniami

# NotificationsDiagnosis_BatteryOptimizationTitle
source: Checking if battery optimization is enabled for this application
pl: Sprawdzanie czy optymalizacja baterii jest włączona dla tej aplikacji

# NotificationsDiagnosis_FcmTokenErrorMessage
source: Synchronizing has failed. Next steps: 1. Server could be down - try again later. 2. Something might be wrong on the server - try signing out and signing in again. 3. If issue persists try contacting support (ways of contact can be found in Settings -> App information).
pl: Synchronizacja nie powiodła się. Kolejne kroki: 1. Serwer może być niedostępny – spróbuj ponownie później. 2. Może występować problem po stronie serwera – spróbuj się wylogować i zalogować ponownie. 3. Jeśli problem nadal występuje, skontaktuj się z pomocą techniczną (sposoby kontaktu znajdziesz w Ustawieniach → Informacje o aplikacji).

# NotificationsDiagnosis_FcmTokenTitle
source: Updating device information on the server
pl: Synchronizowanie informacji o urządzeniu z serwerem

source: Notify
pl: Powiadamiaj

source: Participants
pl: Uczestnicy

source: Payments
pl: Płatności

# PaymentsPage_AccountNumber
source: Account number
pl: Numer konta

# PaymentsPage_AccountNumberCopied
source: Copied account number
pl: Skopiowano numer konta

# PaymentsPage_Amount
source: Amount
pl: Kwota

# PaymentsPage_NoPayments
source: No payments to display
pl: Brak płatności

# PaymentsPage_PaymentDeadline
source: Deadline
pl: Termin

source: Permissions
pl: Pozwolenia

# Permissions_MissingPermissionsDescription
source: Missing permissions, some functions might not work. Log in again.
pl: Brakuje niektórych pozwoleń przez co niektóre funkcje mogą nie działać. Zaloguj się ponownie.

# PersonDetailsPage_EmailCopied
source: Email copied
pl: Skopiowano email

# PersonDetailsPage_PhoneNumberCopied
source: Phone number copied
pl: Skopiowano numer telefonu

source: Points
pl: Punkty

# PushNotifications_UsosNewGrade_DefaultTitleAndBody
source: You have a new grade!
pl: Masz nową ocenę!

# PushNotifications_UsosNewGrade_InterpretedBodySeparator
source: in
pl: z

# PushNotifications_UsosNewGrade_InterpretedTitle
source: New grade
pl: Nowa ocena

# SatisfactionSurveysPage_Empty
source: No surveys to fill
pl: Brak ankiet do wypełnienia

source: Schedule
pl: Plan zajęć

source: Semesters
pl: Semestry

source: Send
pl: Wyślij

# SessionInvalidMessage_Description
source: You have been logged out by USOS. This usually happens when the application is deprived of permissions to your data by the user or the USOS password is changed. Sign in again to use the app.
pl: Nastąpiło wylogowanie przez USOSa. Dzieje się tak zazwyczaj gdy aplikacja zostanie pozbawiona uprawnień do danych przez użytkownika bądź hasło do USOSa zostanie zmienone. Zaloguj się ponownie, aby korzystać z aplikacji.

# SessionInvalidMessage_Title
source: The session has expired
pl: Sesja wygasła

source: Settings
pl: Ustawienia

# SettingsPage_AppInfo
source: Information about application
pl: Informacje o aplikacji

# SettingsPage_CalendarEvents
source: Events from calendar
pl: Wydarzenia z kalendarza

# SettingsPage_ChangingLanguageMessage
source: Changes will be fully visible after restarting the app.
pl: Zmiany będą w pełni widoczne po ponownym uruchomieniu aplikacji.

# SettingsPage_Logs
source: Logs
pl: Logi

# SettingsPage_LogsAllowedModulesButton
source: Logged information
pl: Informacje zbierane w logach

# SettingsPage_RevokeAccessDescription
source: The application will still run on locally stored data, if you want to delete this data log out of the application.
pl: Aplikacja wciąż będzie działać na danych zapisanych lokalnie, jeżeli chcesz usunąć te dane wyloguj się z aplikacji.

# SettingsPage_RevokeAccessTitle
source: Revoke access
pl: Odebranie dostępu

# SettingsPage_TestingTabTitle
source: Testing/diagnostic
pl: Testowanie/diagnostyka

source: Surveys
pl: Ankiety

# SurveysPage_SurveysToFill
source: Surveys to fill
pl: Ankiety do wypełnienia

source: Troubleshooting
pl: Rozwiązywanie problemów

source: Try again
pl: Spróbuj ponownie

source: Type
pl: Typ

# UniversityName
source: Poznań University Of Technology
pl: Politechnika Poznańska

source: Version
pl: Wersja

source: Yes
pl: Tak

# NotificationsDiagnosis_AutoStartCouldNotOpenSettings
source: Didn't find the appropriate settings page
pl: Nie znaleziono odpowiedniej strony z ustawieniami

source: Calendar notifications
pl: Powiadomienia z kalendarza

source: Push notifications
pl: Powiadomienia natychmiastowe (push)

source: Application
pl: Aplikacja

source: Diagnosis
pl: Diagnostyka

# SettingsPage_ResetLocalData
source: Reset local data
pl: Zresetuj dane zapisane lokalnie

source: Operation canceled due to spam
pl: Operacja anulowana z powodu spamu

source: Success
pl: Sukces

source: What's new
pl: Co nowego

# SettingsPage_ApplicationSubPage_WhatsNewFeatured
source: Featured changes
pl: Wyróżnione zmiany

# SettingsPage_ApplicationSubPage_WhatsNewGeneralChanges
source: General changes
pl: Ogólne zmiany

# WhatsNewPage_Next
source: Next
pl: Następne

# WhatsNewPage_Skip
source: Skip
pl: Pomiń

# WhatsNewItem_NewGradeTitle
source: Push notifications for new grade.
pl: Powiadomienia natychmiastowe (push) dla nowych ocen.

# WhatsNewItem_NewGradeDetails
source: Depending on your settings receiving notifications might be blocked. You can perform an automatic check in Settings -> Notifications -> Troubleshooting.
pl: W zależności od ustawień powiadomienia mogą być blokowane. Możesz to zweryfikować w Ustawienia -> Powiadomienia -> Rozwiązywanie problemów.
